In [ ]:
#SQL
Microsoft Windows [Version 10.0.26200.7623]
(c) Microsoft Corporation. All rights reserved.

C:\Users\muska>mysql -u root -p
Enter password: **********
Welcome to the MySQL monitor.  Commands end with ; or \g.
Your MySQL connection id is 15
Server version: 8.0.44 MySQL Community Server - GPL

Copyright (c) 2000, 2025, Oracle and/or its affiliates.

Oracle is a registered trademark of Oracle Corporation and/or its
affiliates. Other names may be trademarks of their respective
owners.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

mysql> CREATE DATABASE student;
Query OK, 1 row affected (0.12 sec)
mysql> USE school;
Database changed
mysql> CREATE TABLE student(
    -> id INT,
    -> name VARCHAR(50),
    -> rollno INT
    -> );
Query OK, 0 rows affected (0.12 sec)

mysql> INSERT INTO student VALUES (1,"Rahul",21);
Query OK, 1 row affected (0.07 sec)

mysql> SELECT * FROM student;
+------+-------+--------+
| id   | name  | rollno |
+------+-------+--------+
|    1 | Rahul |     21 |
+------+-------+--------+
1 row in set (0.03 sec)

mysql> INSERT INTO student VALUES(2,"Karan",22);
Query OK, 1 row affected (0.02 sec)

mysql> INSERT INTO student VALUES(3,"Rohit",23);
Query OK, 1 row affected (0.03 sec)

mysql> SELECT * FROM student;
+------+-------+--------+
| id   | name  | rollno |
+------+-------+--------+
|    1 | Rahul |     21 |
|    2 | Karan |     22 |
|    3 | Rohit |     23 |
+------+-------+--------+
3 rows in set (0.00 sec)

mysql> SELECT *FROM student WHERE id=2;
+------+-------+--------+
| id   | name  | rollno |
+------+-------+--------+
|    2 | Karan |     22 |
+------+-------+--------+
1 row in set (0.03 sec)

mysql> CREATE TABLE class(
    -> id INT,
    -> name VARCHAR(50),
    -> age INT,
    -> course VARCHAR(50),
    -> marks INT
    -> );
Query OK, 0 rows affected (0.07 sec)

mysql> INSERT INTO class VALUES(11,"Raj",23,"Python",90);
Query OK, 1 row affected (0.04 sec)

mysql> INSERT INTO class VALUES(12,"Anita",25,"Java",78),
    -> (13,"Ram",22,"SQL",89),
    -> (14,"Khushi",25,"Python",99),
    -> (14,"Naeem",26,"SQL",80);
Query OK, 4 rows affected (0.03 sec)
Records: 4  Duplicates: 0  Warnings: 0

mysql> SELECT * FROM class;
+------+--------+------+--------+-------+
| id   | name   | age  | course | marks |
+------+--------+------+--------+-------+
|   11 | Raj    |   23 | Python |    90 |
|   12 | Anita  |   25 | Java   |    78 |
|   13 | Ram    |   22 | SQL    |    89 |
|   14 | Khushi |   25 | Python |    99 |
|   14 | Naeem  |   26 | SQL    |    80 |
+------+--------+------+--------+-------+
5 rows in set (0.00 sec)

mysql> SELECT name,marks FROM class;
+--------+-------+
| name   | marks |
+--------+-------+
| Raj    |    90 |
| Anita  |    78 |
| Ram    |    89 |
| Khushi |    99 |
| Naeem  |    80 |
+--------+-------+
5 rows in set (0.00 sec)

mysql> SELECT * FROM class ORDER BY marks DESC;
+------+--------+------+--------+-------+
| id   | name   | age  | course | marks |
+------+--------+------+--------+-------+
|   14 | Khushi |   25 | Python |    99 |
|   11 | Raj    |   23 | Python |    90 |
|   13 | Ram    |   22 | SQL    |    89 |
|   14 | Naeem  |   26 | SQL    |    80 |
|   12 | Anita  |   25 | Java   |    78 |
+------+--------+------+--------+-------+
5 rows in set (0.03 sec)

mysql> SELECT AVG(marks) FROM class;
+------------+
| AVG(marks) |
+------------+
|    87.2000 |
+------------+
1 row in set (0.04 sec)

mysql> SELECT COUNT(*) FROM class;
+----------+
| COUNT(*) |
+----------+
|        5 |
+----------+
1 row in set (0.05 sec)

mysql> SELECT * FROM class WHERE id = 2 AND marks = 90;
Empty set (0.03 sec)

mysql> SELECT * FROM class WHERE id = 3 AND marks = 90;
Empty set (0.00 sec)

mysql> SELECT * FROM class WHERE id = 3 OR marks = 90;
+------+------+------+--------+-------+
| id   | name | age  | course | marks |
+------+------+------+--------+-------+
|   11 | Raj  |   23 | Python |    90 |
+------+------+------+--------+-------+
1 row in set (0.00 sec)

mysql> SELECT * FROM class WHERE id = 11 OR marks = 90;
+------+------+------+--------+-------+
| id   | name | age  | course | marks |
+------+------+------+--------+-------+
|   11 | Raj  |   23 | Python |    90 |
+------+------+------+--------+-------+
1 row in set (0.00 sec)

mysql> DELETE FROM class WHERE id = 3;
Query OK, 0 rows affected (0.03 sec)

mysql> SELECT * FROM class LIMIT 2;
+------+-------+------+--------+-------+
| id   | name  | age  | course | marks |
+------+-------+------+--------+-------+
|   11 | Raj   |   23 | Python |    90 |
|   12 | Anita |   25 | Java   |    78 |
+------+-------+------+--------+-------+
2 rows in set (0.00 sec)

mysql> SELECT * FROM class ORDER BY marks DESC LIMIT 2;
+------+--------+------+--------+-------+
| id   | name   | age  | course | marks |
+------+--------+------+--------+-------+
|   14 | Khushi |   25 | Python |    99 |
|   11 | Raj    |   23 | Python |    90 |
+------+--------+------+--------+-------+
2 rows in set (0.02 sec)

mysql> UPDATE class set marks = 33 WHERE id = 1;
Query OK, 0 rows affected (0.03 sec)
Rows matched: 0  Changed: 0  Warnings: 0

mysql> TRUNCATE TABLE class;
Query OK, 0 rows affected (0.11 sec)

mysql> DROP TABLE class;
Query OK, 0 rows affected (0.10 sec)

mysql> SELECT course, AVG(marks) FROM class GROUP BY course;
mysql> CREATE TABLE candidates(
    -> id INT,
    ->  name VARCHAR(50),
    -> age INT,
    -> course VARCHAR(20),
    -> marks INT
    -> );
Query OK, 0 rows affected (0.07 sec)

mysql> SELECT * FROM candidates
    -> ;
Empty set (0.02 sec)

mysql> INSERT INTO candidates VALUES
    -> (1,"Rahul",20,"Python",85)
    -> ,
    -> (1,"Rahul",20,"Python",85);
Query OK, 2 rows affected (0.04 sec)
Records: 2  Duplicates: 0  Warnings: 0

mysql> SELECT * FROM candidates;
+------+-------+------+--------+-------+
| id   | name  | age  | course | marks |
+------+-------+------+--------+-------+
|    1 | Rahul |   20 | Python |    85 |
|    1 | Rahul |   20 | Python |    85 |
+------+-------+------+--------+-------+
2 rows in set (0.03 sec)


mysql> INSERT INTO candidates VALUES
    -> (2,"Anita",22,"SQL",75),
    -> (3,"Aman",34,"Python",85),
    -> (4,"Neha",18,"Java",88),
    -> (5,"Karan",22,"Java",90);
Query OK, 4 rows affected (0.03 sec)
Records: 4  Duplicates: 0  Warnings: 0

mysql> SELECT * FROM candidates;
+------+-------+------+--------+-------+
| id   | name  | age  | course | marks |
+------+-------+------+--------+-------+
|    1 | Rahul |   20 | Python |    85 |
|    1 | Rahul |   20 | Python |    85 |
|    2 | Anita |   22 | SQL    |    75 |
|    3 | Aman  |   34 | Python |    85 |
|    4 | Neha  |   18 | Java   |    88 |
|    5 | Karan |   22 | Java   |    90 |
+------+-------+------+--------+-------+
6 rows in set (0.00 sec)

mysql> SELECT course , AVG(marks) FROM candidates GROUP BY course;
+--------+------------+
| course | AVG(marks) |
+--------+------------+
| Python |    85.0000 |
| SQL    |    75.0000 |
| Java   |    89.0000 |
+--------+------------+
3 rows in set (0.04 sec)

mysql> SELECT course, age, AVG(marks), MAX(marks) from candidates GROUP BY course, age;
+--------+------+------------+------------+
| course | age  | AVG(marks) | MAX(marks) |
+--------+------+------------+------------+
| Python |   20 |    85.0000 |         85 |
| SQL    |   22 |    75.0000 |         75 |
| Python |   34 |    85.0000 |         85 |
| Java   |   18 |    88.0000 |         88 |
| Java   |   22 |    90.0000 |         90 |
+--------+------+------------+------------+
5 rows in set (0.03 sec)

mysql> SELECT name, id, AVG(age), MIN(marks) from candidates GROUP BY name,id;
+-------+------+----------+------------+
| name  | id   | AVG(age) | MIN(marks) |
+-------+------+----------+------------+
| Rahul |    1 |  20.0000 |         85 |
| Anita |    2 |  22.0000 |         75 |
| Aman  |    3 |  34.0000 |         85 |
| Neha  |    4 |  18.0000 |         88 |
| Karan |    5 |  22.0000 |         90 |
+-------+------+----------+------------+
5 rows in set (0.00 sec)

mysql> CREATE TABLE employees (
    ->     emp_id INT,
    ->     emp_name VARCHAR(50),
    ->     department VARCHAR(30),
    ->     gender VARCHAR(10),
    ->     city VARCHAR(30),
    ->     salary INT,
    ->     experience INT
    -> );
Query OK, 0 rows affected (0.07 sec)

mysql> INSERT INTO employees VALUES
    -> (1, 'Rahul', 'IT', 'Male', 'Delhi', 70000, 5),
    -> (2, 'Anita', 'HR', 'Female', 'Mumbai', 50000, 4),
    -> (3, 'Aman', 'IT', 'Male', 'Delhi', 90000, 8),
    -> (4, 'Neha', 'Finance', 'Female', 'Pune', 60000, 6),
    -> (5, 'Rohit', 'IT', 'Male', 'Mumbai', 75000, 5),
    -> (6, 'Priya', 'HR', 'Female', 'Delhi', 48000, 3),
    -> (7, 'Vikas', 'Finance', 'Male', 'Pune', 65000, 7),
    -> (8, 'Sneha', 'IT', 'Female', 'Bangalore', 85000, 6),
    -> (9, 'Arjun', 'HR', 'Male', 'Mumbai', 52000, 4),
    -> (10,'Kavya', 'Finance', 'Female', 'Delhi', 72000, 8);
Query OK, 10 rows affected (0.02 sec)
Records: 10  Duplicates: 0  Warnings: 0

mysql> SELECT department, AVG(salary), FROM employees GROUP BY department;
ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'FROM employees GROUP BY department' at line 1
mysql> SELECT department, AVG(salary) FROM employees GROUP BY department;
+------------+-------------+
| department | AVG(salary) |
+------------+-------------+
| IT         |  80000.0000 |
| HR         |  50000.0000 |
| Finance    |  65666.6667 |
+------------+-------------+
3 rows in set (0.00 sec)

mysql> SELECT city, SUM(salary) FROM employees GROUP BY city;
+-----------+-------------+
| city      | SUM(salary) |
+-----------+-------------+
| Delhi     |      280000 |
| Mumbai    |      177000 |
| Pune      |      125000 |
| Bangalore |       85000 |
+-----------+-------------+
4 rows in set (0.00 sec)

mysql> SELECT department, COUNT(*) FROM employees WHERE salary>600000 GROUP BY department;
Empty set (0.04 sec)

mysql> SELECT department, COUNT(*) FROM employees WHERE salary>60000 GROUP BY department;
+------------+----------+
| department | COUNT(*) |
+------------+----------+
| IT         |        4 |
| Finance    |        2 |
+------------+----------+
2 rows in set (0.00 sec)

mysql> SELECT department, COUNT(*) as COUNT_E FROM employees WHERE salary>60000 GROUP BY department;
+------------+---------+
| department | COUNT_E |
+------------+---------+
| IT         |       4 |
| Finance    |       2 |
+------------+---------+
2 rows in set (0.03 sec)

mysql> SELECT department, city, AVG(salary) as Avg_salary FROM employees GROUP BY department, city;
+------------+-----------+------------+
| department | city      | Avg_salary |
+------------+-----------+------------+
| IT         | Delhi     | 80000.0000 |
| HR         | Mumbai    | 51000.0000 |
| Finance    | Pune      | 62500.0000 |
| IT         | Mumbai    | 75000.0000 |
| HR         | Delhi     | 48000.0000 |
| IT         | Bangalore | 85000.0000 |
| Finance    | Delhi     | 72000.0000 |
+------------+-----------+------------+
7 rows in set (0.03 sec)

mysql> SELECT * FROM employees;
+--------+----------+------------+--------+-----------+--------+------------+
| emp_id | emp_name | department | gender | city      | salary | experience |
+--------+----------+------------+--------+-----------+--------+------------+
|      1 | Rahul    | IT         | Male   | Delhi     |  70000 |          5 |
|      2 | Anita    | HR         | Female | Mumbai    |  50000 |          4 |
|      3 | Aman     | IT         | Male   | Delhi     |  90000 |          8 |
|      4 | Neha     | Finance    | Female | Pune      |  60000 |          6 |
|      5 | Rohit    | IT         | Male   | Mumbai    |  75000 |          5 |
|      6 | Priya    | HR         | Female | Delhi     |  48000 |          3 |
|      7 | Vikas    | Finance    | Male   | Pune      |  65000 |          7 |
|      8 | Sneha    | IT         | Female | Bangalore |  85000 |          6 |
|      9 | Arjun    | HR         | Male   | Mumbai    |  52000 |          4 |
|     10 | Kavya    | Finance    | Female | Delhi     |  72000 |          8 |
+--------+----------+------------+--------+-----------+--------+------------+
10 rows in set (0.00 sec)

mysql> SELECT department, COUNT(*) as Male_Count FROM employees GROUP BY department;
+------------+------------+
| department | Male_Count |
+------------+------------+
| IT         |          4 |
| HR         |          3 |
| Finance    |          3 |
+------------+------------+
3 rows in set (0.00 sec)

mysql> SELECT department, COUNT(*) as Male_Count FROM employees WHERE gender = "Male" GROUP BY department;
+------------+------------+
| department | Male_Count |
+------------+------------+
| IT         |          3 |
| Finance    |          1 |
| HR         |          1 |
+------------+------------+
3 rows in set (0.01 sec)

mysql> SELECT department, gender, MAX(salary) as Highest_salary FROM employees GROUP BY department, gender GROUP BY department, Highest_salary DESC;
ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'GROUP BY department, Highest_salary DESC' at line 1
mysql> SELECT department, gender, MAX(salary) as Highest_salary FROM employees GROUP BY department, gender ORDER BY department, Highest_salary DESC;
+------------+--------+----------------+
| department | gender | Highest_salary |
+------------+--------+----------------+
| Finance    | Female |          72000 |
| Finance    | Male   |          65000 |
| HR         | Male   |          52000 |
| HR         | Female |          50000 |
| IT         | Male   |          90000 |
| IT         | Female |          85000 |
+------------+--------+----------------+
6 rows in set (0.03 sec)